Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེས་བསླབ་པའི་གཞི་ཁ་ཅིག་ནི་བསྲུངས་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: Still, he maintained some of the fundamental precepts, and at the time of his death he prayed,

source: དགེ་བའི་རྩ་བ་འདིས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: ‘By this root of virtue, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’

source: དེའི་ཚེ་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གླང་པོ་ཆེ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that monk then is none other than this elephant.

source: དེས་དེར་བསླབ་པའི་གཞི་ཆེ་ཕྲ་མང་དུ་མ་བསྲུངས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་དུད་འགྲོའི་ནང་དུ་སྐྱེས་སོ། །
en: The act of failing to maintain both the lesser and greater fundamental precepts ripened into his birth among the animals.

source: དེས་དེར་བསླབ་པའི་གཞི་ཁ་ཅིག་བསྲུངས་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ་
en: Since he protected some of the fundamental precepts, at the time of his death he prayed,

source: དགེ་བའི་རྩ་བ་འདིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་པ་
en: ‘By this root of virtue, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.’

source: དེས་ནི་དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་ཤུགས་མཉམ་པ་དང་མཛད་པ་མཉམ་པ་དང་ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས་འདིས་ད་ལྟར་ང་མཉེས་པར་བྱས་ཏེམི་མཉེས་པར་མ་བྱས་པ་ནི་འདས་པའི་ལས་ཡིན་ནོ། །
en: “So it is monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—that he has pleased me and not displeased me. These were his past actions.

source: ད་ལྟར་བྱུང་བའི་ལས་གང་ཞེ་ན། དེ་གླང་པོ་ཆེར་གྱུར་ནས་ང་ལ་བསྙེན་བཀུར་བྱས་ཏེ། སེམས་དགའ་བར་བྱས་པ་དེས་ན་ལྷའི་ནང་དུ་སྐྱེས་ཏེ་འདི་ནི་ད་ལྟར་བྱུང་བའི་ལས་ཡིན་ནོ།། །།
en: “As for his present actions, the monk became an elephant who offered me his respectful service with a mind full of joy, so he took birth among the gods. These were his present actions.”

source: ཀླུ་ཞེས་བྱ་བ་ནི།
en: The Nāga (1)

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ཀླུའི་རྒྱལ་པོ་དབྱིག་ཅེས་བྱ་བ་ཞིག་གནས་ཏེ།
en: When the Blessed One was in Śrāvastī, a nāga king called Vasu lived in the great ocean.

source: དེས་ཀླུའི་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: When the time came for him to marry he took a nāga wife, and they enjoyed themselves and coupled.

source: དེ་ནས་ཕྱི་ཞིག་ན་བུ་ཁྱེའུ་ཞིག་བཙས་ཏེ་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས།
en: One day she gave birth to a child, and at the elaborate feast celebrating his birth they asked,

source: བུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: “What name should we give this child?”

source: བུ་འདི་དབྱིག་གི་བུ་ཡིན་པས་ན། འདིའི་མིང་དབྱིག་བཟངས་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since this is Vasu’s child, his name will be Vasubhadra.”

source: དེ་ནས་བུ་དབྱིག་བཟངས་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ནས།
en: Young Vasubhadra was reared on milk, yogurt, butter, ghee, and milk solids,

source: དེ་ཆེར་སྐྱེས་ཏེ་འགྲོ་ནུས་པར་གྱུར་ཏོ། །
en: and he grew up, and learned to get around.

source: ཀླུ་རྣམས་ཀྱི་ཆོས་ཀྱིས་ནི་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་དུ་ལུས་ལ་ཀླུའི་བྱེ་མ་འབབ་སྟེ།
en: Now it is characteristic of the nāgas that three times each day and three times each night the nāga sands rain down on their bodies.

source: གཞི་དེས་ན་དེ་དག་གིས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་བར་འགྱུར་ཏེ།
en: This causes them to undergo dreadful suffering and extreme, excruciating, unbearable agony.

source: བུ་དེ་བྱིས་པ་ཤེད་མ་བྱེ་བའི་བར་དུ་ནི་དེའི་ལུས་ལ་ཀླུའི་བྱེ་མ་དེ་མི་འབབ་བོ། །
en: Until the day the child came into his own, the nāga sands never rained down on his body.

source: གང་གི་ཚེ་ཆེར་སྐྱེས་ཤིང་ཤེད་བྱེ་བར་གྱུར་པ་དེའི་ཚེ་ནི་དེའི་ལུས་ལ་ཡང་ཀླུའི་བྱེ་མ་འབབ་པར་འགྱུར་ཏེ
en: But once he had grown and come into his own, the nāga sands rained down on him too

source: གཞི་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་ནས། ཕ་མ་ལ་དྲིས་པ།
en: and caused him dreadful suffering and extreme, excruciating, unbearable agony, so he asked his parents,

source: ཡབ་ཡུམ་བདག་གིས་ཡུན་ཇི་སྲིད་ཅིག་གི་བར་དུ་སྡུག་བསྔལ་འདི་ལྟ་བུ་མྱོང་བར་འགྱུར།
en: “Mother, Father, how long must I undergo such suffering?”

source: ཕ་མས་སྨྲས་པ།
en: His parents replied,

source: བུ་ཇི་སྲིད་དུ་སྐལ་བ་མཉམ་པ་འདི་ཡོད་པ་དེ་སྲིད་དུ་ཁྱོད་ཀྱིས་སྡུག་བསྔལ་འདི་ལྟ་བུ་མྱོང་བར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: “For as long as it is destined to you, son, you will undergo these sufferings.”

source: དེ་ནས་བུ་དེས་བལྟས་ན། ཀླུ་ཆེན་པོ་གཞན་དག་གི་ལུས་ལ་ཀླུའི་བྱེ་མ་མི་འབབ་པ་མཐོང་ངོ་། །
en: The young nāga looked and saw that the nāga sands didn’t rain down on the bodies of other nāgas.

source: མཐོང་ནས་ཀྱང་ཕ་མ་ལ་དྲིས་པ།
en: Seeing this he asked his parents,

source: ཡབ་ཡུམ་ལོག་པར་ལྟུང་བར་གྱུར་པ་འདྲ་ན།
en: “Mother, Father, I think we have fallen into a lower realm.

source: ཅིའི་ཕྱིར་ཀླུ་ཆེན་པོ་འདི་དག་གི་ལུས་ལ་ནི་ཀླུའི་བྱེ་མ་མི་འབབ་ལ། བདག་ཅག་གི་ལུས་ལ་ནི་འབབ།
en: For if the nāga sands don’t rain down on those high nāgas there, why do they rain down on our bodies?”

source: ཕ་མས་དེ་ལ་སྨྲས་པ། ཀླུ་ཆེན་པོ་འདི་དག་ནི་ཆེ་བར་གྲགས་པ་ཡིན་ཏེ
en: “Those high nāgas are of great renown,” his parents replied.

source: ཆེ་བར་གྲགས་པ་ཡིན་པས་ན་དེ་དག་ལ་ནི་མི་འབབ་བོ། །
en: “It’s because of their great renown that they aren’t rained down upon.”

source: དེ་ནས་དེས་བལྟས་ན་རྒྱ་མཚོ་ཆེན་པོ་དེའི་ནང་ན་ཀླུ་བདག་ཅག་པས་ཆེས་ངན་པ་དེ་དག་གི་ལུས་ལ་ཡང་ཀླུའི་བྱེ་མ་མི་འབབ་པར་མཐོང་ངོ་། །
en: Then he looked and saw that in the great ocean there were some nāgas who were even more wretched than they were, but nāga sand wasn’t raining down on their bodies.

source: མཐོང་ནས་ཀྱང་ཕ་མ་ལ་སྨྲས་པ།
en: Seeing this, he asked his parents,

source: ཡབ་ཡུམ་ཁྱེད་གཉིས་ན་རེ་ཀླུ་ཆེན་པོ་འདི་དག་ནི་ཆེ་བར་གྲགས་པ་ཡིན་ཏེ།
en: “Mother, Father, are you telling me that these are all nāgas of great renown,

source: ཆེ་བར་གྲགས་པ་ཡིན་པས་ན་འདི་དག་གི་ལུས་ལ་ཀླུའི་བྱེ་མ་མི་འབབ་བོ་ཞེ་ན།
en: and that because of their great renown nāga sand isn’t raining down on their bodies?

source: འདི་ན་བདག་ཅག་པས་ཆེས་ངན་པ་གཞན་དག་ཀྱང་ཡོད་ན།
en: For there are some here who are even more wretched than we are.

source: ཅིའི་ཕྱིར་དེ་དག་ལ་ནི་ཀླུའི་བྱེ་མ་མི་འབབ་ལ་བདག་ཅག་ལ་ནི་འབབ།
en: Why then, if nāga sand isn’t raining down on their bodies, is it still raining down on ours?”

source: ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ། དེ་དག་ནི་བདག་ཅག་བས་ཆེས་ངན་མོད་ཀྱི། འོན་ཀྱང་དེ་དག་གིས་ནི་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་བླངས་པས་ན།
en: “Though they are more wretched than we are,” explained his parents, “nonetheless they take refuge and maintain the fundamental precepts.

source: དེའི་ཕྱིར་དེ་དག་གི་ལུས་ལ་ཀླུའི་བྱེ་མ་མི་འབབ་བོ། །
en: That’s why nāga sand doesn’t rain down on their bodies.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བུ་དེ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: When he heard this, he surged with joy.

source: སྨྲས་པ་ཡབ་ཡུམ་དེ་དག་གི་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་ག་ལས་བྱུང་།
en: “Mother, Father,” he asked, “how is that they came to take refuge and the fundamental precepts?”

source: དེ་གཉིས་ཀྱིས་སྨྲས་པ། ཡུལ་དབུས་འདིར་སངས་རྒྱས་བྱུང་སྟེ།
en: “A buddha has arisen here, in this central land,” they said.

source: དེ་ནི་བདུད་རྩིའི་ཆར་འབེབས་པས། དེ་ལས་དེ་དག་གི་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བྱུང་ངོ་། །
en: “He has let fall a rain of nectar, and so they have come to take refuge and the fundamental precepts.”

source: ཀླུའི་བུ་དེས་སྨྲས་པ། ཡབ་ཡུམ་བདག་མཆི་བར་གནང་བར་མཛོད་ཅིག་དང་། གང་དག་གི་མཐུས་བདག་གི་ལུས་ལ་ཀླུའི་བྱེ་མ་འབབ་པར་མི་འགྱུར་བའི་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་དེ་དག་བདག་གིས་བླང་བར་བགྱིའོ། །
en: “Mother, Father,” the young nāga requested, “please, permit me to go take refuge and maintain the fundamental precepts, by whose power nāga sand will no longer rain down on my body.”

source: ཕ་མས་སྨྲས་པ། བུ་མ་ལེན་ཅིག །
en: “Do not take them, son,” cautioned his parents.

source: ལྷན་ཅིག་སྐྱེས་པའི་བྱེ་མའི་སྡུག་བསྔལ་འདི་ནི་ཆུང་གི །
en: “Though the sufferings of the sands are innate to us, they are minor.

source: སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་དེ་དག་བླངས་པ་ལས་མ་བསྲུངས་ན། གཞི་དེ་ལས་སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོ་དང་ཡི་དགས་སུ་སྐྱེས་ནས་སྡུག་བསྔལ་ཆེན་པོ་རྣམས་མྱོང་བར་འགྱུར་ཏེ། སྡུག་བསྔལ་འདི་ནི་སྡུག་བསྔལ་འདིའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད་སྟོང་གི་ཆར་ཡང་མི་ཕོད་འབུམ་གྱི་ཆར་ཡང་མི་ཕོད་དོ། །
en: If you take refuge and the fundamental precepts but do not maintain them, it will be the basis of your taking rebirth as a hell being, an animal, or an anguished spirit, where you will undergo great suffering, compared to which your current sufferings are not even a fraction’s worth—not even a hundredth, not even a thousandth, not even a hundred thousandth.”

source: ཀླུའི་བུས་སྨྲས་པ། ཡབ་ཡུམ་བདག་གི་ལྷན་ཅིག་སྐྱེས་པའི་བྱེ་མའི་སྡུག་བསྔལ་འདི་ཞི་བར་འགྱུར་བ་འབའ་ཞིག་གི་ཕྱིར་ཡང་ཅི་ནུས་ཀྱིས་བསྲུང་བར་བགྱིའོ་
en: “Mother, Father,” said the young nāga, “I shall maintain them to the best of my ability, if only to assuage the sufferings of the sands innate to us.”

source: ཞེས་སྨྲས་ནསཀླུའི་བུ་དེས་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་སྟེ།
en: With those words the young nāga filled up the front of his long shirt with divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers,

source: རྒྱ་མཚོ་ཆེན་པོའི་ནང་ནས་མི་སྣང་བར་གྱུར་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཕྱིན་པ་དང་།
en: disappeared from beneath the great ocean, and traveled to the garden of Prince Jeta,

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་ནང་ན་ཆོས་སྟོན་ཅིང་བཞུགས་སོ། །
en: where the Blessed One sat teaching the Dharma amid a company of hundreds.

source: དེ་ནས་ཀླུའི་བུ་དེས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཛེས་ཤིང་ཡིད་དུ་འཐད་པ་དབང་པོ་དུལ་བ་ཐུགས་ཞི་བ་ཐུགས་དུལ་ཞིང་
en: The young nāga saw the Blessed Buddha, resplendent and agreeable, in the distance. His senses were tamed, his heart was at peace, and his mind was tame and absolutely serene.

source: རྣམ་པར་ཞི་བའི་མཆོག་དང་ལྡན་པ། གསེར་གྱི་མཆོད་སྡོང་ལྟར་དཔལ་དང་གཟི་བརྗིད་འབར་བ་མཐོང་ངོ་། །
en: He was graced with a supreme tranquility, shining and radiant like a golden pillar.

source: དགའ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་ཀྱིས་གཏོར་ཏེ།
en: Full of such joy he approached the Blessed One, and when he arrived he scattered the divine blue lotus, lotus, white water lily, and white lotus flowers over the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་མནོས་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: took refuge in the Blessed One, received the fundamental precepts, and sat before him to listen to the Dharma.

source: དེ་ནས་དེའི་ཀླུའི་བྱེ་མ་མེད་པར་གྱུར་ནས། དེས་བསམས་པ་བཅོམ་ལྡན་འདས་ནི་བདག་གི་སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་མང་པོ་སེལ་བ་དང་བདེ་བ་དང་ཡིད་བདེ་བ་རྣམ་པ་དུ་མ་ཐོབ་པར་མཛད་པ་ཡིན་ན་
en: Now that the nāga sands affected him no more, he thought, “The Blessed One has dispelled many kinds of suffering and unhappiness, and brought me many kinds of happiness and bliss.

source: བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་དྲིན་ཇི་ལྟར་བསབ་པར་བྱ།
en: How could I repay the Blessed One?

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་གནང་བར་མཛད་ན། བདག་གིས་ཇི་སྲིད་འཚོའི་བར་དུ། སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱའོ་སྙམ་ནས།
en: If the Blessed One will permit it, for as long as I live, I will respectfully serve the Buddha and the rest of the saṅgha of monks with all their needs.”

source: སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and implored him,

source: ཇི་སྲིད་འཚོའི་བར་དུ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ན་བཟའ་དང་ཞལ་ཟས་དང་གཟིམས་ཆ་དང་གདན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་སྦྱར་བར་འཚལ་ན།
en: “Blessed One, for as long as I live please permit me to provide the Buddha and the entire saṅgha of monks with provisions of clothing, food, bedding, seats, and medicines for the sick.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་གནང་བར་མཛད་དུ་གསོལ།
en: Blessed One, please permit me to do so.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་གཞན་དག་ལ་ཡང་ཕན་གདགས་དགོས་ཀྱིས་
en: “Young man,” the Blessed One replied, “please let me go, for there are others who also need my help.”

source: ཐོང་ཤིག་དེ་ནས་བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པར་དབྱར་བཞུགས་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: After the Blessed One remained in retreat in Śrāvastī during the rains, he instructed Venerable Ānanda, saying,

source: ཀུན་དགའ་བོ་སོང་ལ་དགེ་སློང་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་ཡུལ་མ་ག་དྷཱར་ལྗོངས་སུ་རྒྱུ་ཞིང་གཤེགས་ཀྱིས།
en: “Ānanda, go and give this message to the monks: tell them that the Tathāgata will travel through the countryside to Magadha.

source: སུ་ནི་དེ་བཞིན་གཤེགས་པ་དང་ཐབས་ཅིག་ཏུ་ལྗོངས་རྒྱུ་ཞིང་འགྲོ་འདོད་པ་དེ་ཆོས་གོས་དག་དང་ཆོས་ཤིག་ཅེས་སྦྲོན་ཅིག །
en: Inform them that those who wish to travel through the countryside with the Tathāgata should prepare their robes.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཇི་སྲིད་དགྱེས་པའི་བར་དུ་མཉན་དུ་ཡོད་པ་ན་བཞུགས་བཞུགས་ནས་རྒྱལ་པོའི་ཁབ་ག་ལ་བ་དེར་རྒྱུ་ཞིང་གཤེགས་སོ། །
en: Then, after staying in Śrāvastī for as long as he liked, the Blessed One traveled to Rājagṛha.

source: དེ་ནས་ཀླུའི་བུ་དེས་བསམས་པ་ཇི་སྲིད་འཚོའི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱ་བར་བཅོམ་ལྡན་འདས་ཀྱིས་མ་གནང་མོད་ཀྱི། བདག་གིས་ལམ་འདིར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱའོ་སྙམ་ནས
en: The young nāga thought, “Even though the Blessed One would not permit me to respectfully serve them with provisions of clothing, food, bedding, seats, and medicines for the sick for as long as I live, while they are on this road I can provide the Buddha and the rest of the saṅgha of monks with all their needs.”

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and implored the Blessed One again,

source: མཉན་དུ་ཡོད་པ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་བར་དུ། བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ན་བཟའ་དང་ཞལ་ཟས་དང་གཟིམས་ཆ་དང་གདན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་སྦྱར་བར་འཚལ་ན
en: “I would like to provide the Blessed One and the rest of the saṅgha of monks with provisions of clothing, food, bedding, seats, and medicines for the sick as we travel from Śrāvastī to Rājagṛha.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་བུ་དེ་ལ་ཅང་མི་གསུང་བས་གནང་ནས་ཀླུའི་བུ་དེས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། མཉན་དུ་ཡོད་པ་ནས་
en: The Blessed One assented by his silence. Understanding that by his silence the Blessed One had given his assent,

source: རྒྱལ་པོའི་ཁབ་ཀྱི་བར་གྱི་ལམ་ཐོག་ཐག་ཏུ་རྡོ་དང་གསེག་མ་དང་གྱོ་མོ་རྣམས་བསལ་ཏེ། སྟོར་ཁུང་དང་ཕྱི་སའི་འདམ་དང་ཕྱག་དར་ཉལ་ཉིལ་དང་ཤིང་དང་བོང་བ་རྣམས་མེད་པར་བྱས་ནས།
en: straightaway the young nāga cleared the road from Śrāvastī to Rājagṛha of stones, pebbles, and gravel, cleaned the roadside ditches, and swept away mud, filth, twigs, and dung until there was no more.

source: ས་གཞི་གསིང་མ་སྔོན་པོས་ཁྱབ་པར་བྱས་ནས། སྤོས་ཆབ་ཀྱིས་ཆག་ཆག་བཏབ་པ།
en: Then he covered the ground with green grass and sprinkled it with fragrant water to settle the dust.

source: ངོས་གཡས་གཡོན་ནས་མེ་ཏོག་གི་ཤིང་དང་འབྲས་བུའི་ཤིང་དག་གིས་འཁྱམས་འདྲ་བར་དཀྲིགས་ཏེ། ནེ་ཙོ་དང་རི་སྐེགས་དང་རྨ་བྱ་དང་།
en: All along either side he laid branches of fruits and flowers, as if it were a courtyard, and it resounded with singing parrots, peacocks, mountain birds, and cakravāka birds.

source: ཤང་ཤང་ཏེའུ་རྣམས་སྐད་འབྱིན་པ་བཀོད་མ་དང་། མཚེའུ་དང་ལྟེང་ཀ་དང་རྫིང་རྣམས་མེ་ཏོག་དང་། པད་མ་དང་། ཨུད་པ་ལ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་ཀྱིས་གང་བར་འདུག་ལ། ངང་པ་དང་ངུར་པ་དང་ཟལ་མོ་རྣམས་སྐད་འབྱིན་པ་དག་སྤྲུལ་ཏེ
en: He filled the ponds, pools, and reservoirs with lotus, blue lotus, white water lily, and white lotus flowers, and he magically manifested honking swans and geese and quacking ducks.

source: ལམ་ཐོག་ཐག་ཏུ་བུམ་པ་གང་བ་དང་ཆུ་ཤིང་གི་སྡོང་བུ་དང་ཕྲེང་བའི་མཆོག་རྣམས་ནི་ཚར་དུ་སྦྲེངས།
en: He filled the length of the road with vases and lined the sides with banana trees and marvelous garlands.

source: གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་རྣམས་ནི་བསྒྲེང་རས་སྣ་ཚོགས་ནི་སྦྱངས་རྔ་ཡབ་སྣ་ཚོགས་ནི་བཙུགས་གློ་གཡས་གཡོན་དུ་ནི་གཟིམས་ཁྲི་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་བཤམས་དར་གྱི་བླ་རེ་རྣམས་ནི་བྲེས།
en: He set up parasols, banners, and flags, decorated them with various colored fabrics, and set out yak-tail whisks. On the right and on the left he arrayed blue, yellow, red, and white platforms, overlaid with sashed canopies,

source: ཟླ་བ་དང་ཟླ་བ་ཚེས་པ་དང་མེ་ལོང་རྣམས་ཀྱིས་ནི་བརྒྱན།
en: and decorated with moons, crescents, and mirrors.

source: མགུལ་གདུབ་དང་གདུབ་བུ་རྒྱན་ཅན་དང་དཔུང་རྒྱན་དང་རྒྱན་ཕྲེང་དང་སེ་མོ་དོ་རྣམས་ཀྱིས་ནི་མཛེས་པར་བྱས།
en: He decorated himself with bangles around the neck and wrists, armlets, garlands of ornaments, and strings of precious stones.

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆུན་པོ་རྣམས་ཀྱིས་ནི་ཁེབས་པར་བྱས་ཏེ་སྤྲུལ་ཏོ། །
en: He magically manifested cascading bouquets of flowers in elaborate arrangements,

source: དེར་མི་མང་པོ་དག་ཀྱང་སྤྲུལ་ཏེ།
en: and he magically manifested crowds of people as well.

source: ལ་ལ་ནི་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་གདུགས་རྩིབས་བརྒྱ་པ་དག་འཛིན་པར་བྱེད།
en: Some held hundred-ribbed parasols over the Buddha and the rest of the saṅgha of monks.

source: ལ་ལ་ནི་བླ་རེ་འཛིན་པར་བྱེད།
en: Some held canopies aloft.

source: ལ་ལ་ནི་རྔ་ཡབ་གསེར་གྱི་ཡུ་བ་ཅན་དང་། ནོར་བུའི་ཡུ་བ་ཅན་དག་གིས་གཡོབ་པར་བྱེད།
en: Some waved fans with golden handles, others waved fans with bejeweled handles,

source: ལ་ལ་ནི་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་རྣམས་འཐོར་བར་བྱེད་དོ། །
en: and some scattered lotus, blue lotus, white water lily, and white lotus flowers.

source: ཀླུའི་བུ་དེ་ཉིད་ནི་བཅོམ་ལྡན་འདས་ལ་བདུག་པ་དང་ཕྱེ་མ་དང་སྤོས་དང་མེ་ཏོག་རྣམས་ཀྱིས་མཆོད་པ་བྱེད་ཅིང་ཕྱི་བཞིན་འབྲང་སྟེ།
en: The young nāga followed close behind the Blessed One, worshiping him with flowers, and burning sticks of incense, incense powder, and incense cones.

source: དེས་ཕྱོགས་གང་དང་གང་དུ་བཅོམ་ལྡན་འདས་མཉེལ་བསོ་བའི་ཕྱོགས་དེ་དང་དེར་གདན་རྣམས་སྤྲུལ་པར་བྱེད་དོ། །
en: Whenever and wherever the Blessed One paused in repose, then and there he magically manifested a seat.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་སྦྱར་བའི་བཏུང་བ་དང་། ཧྭགས་དང་། འདམ་བུ་ཁ་ར་དང་། ཁ་ར་རྣམས་ཀྱིས་ཀྱང་ཚིམ་པར་བྱེད་དོ། །
en: He contented the Buddha and the rest of the saṅgha of monks with a blend of molasses, sugarcane juice, and refined sugar.

source: ཕྱོགས་གང་དང་གང་དུ་བཅོམ་ལྡན་འདས་གཤེགས་དགོངས་མཛད་པའི་ཕྱོགས་དེ་དང་དེར་ནི་རྣམ་པ་ཐམས་ཅད་རྫོགས་པའི་གཙུག་ལག་ཁང་སྤྲུལ་པར་བྱེད་དོ། །
en: Whenever and wherever the Blessed One made camp for the night, then and there he would magically manifest a monastery that was complete in every respect.

source: དགེ་སློང་རྣམས་ལ་ཡང་རྐང་པ་བཀྲུ་བའི་སྤོས་ཆུ་དང་རྐང་པ་བསྐུ་བའི་ཏིལ་མར་སྤོས་ཅན་འབུལ་བར་བྱེད་དོ། །
en: He also offered scented water for the monks to wash their feet and fragrant sesame oil to anoint them.

source: དེ་ནས་ཕྱི་དེ་ཉིན་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ནས་
en: Then the following day, once he had contented the Buddha and the rest of the saṅgha of monks with many good and wholesome foods,

source: ཡང་བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟི་བྱེད་བླ་མར་བྱེད་རིམ་གྲོ་བྱེད་མཆོད་པ་བྱེད་ཅིང་ཕྱི་བཞིན་འབྲང་ངོ་། །
en: he would again accompany the Buddha, venerating him, treating him as his guru, and offering him honor and worship.

source: དེ་ནས་བཅོམ་ལྡན་འདས་མཐར་གྱིས་གཤེགས་གཤེགས་པ་ལས་རྒྱལ་པོའི་ཁབ་ཏུ་བྱོན་ཏེ། རྒྱལ་པོའི་ཁབ་ན་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པར་བཞུགས་སོ། །
en: The Blessed One traveled and traveled until eventually he arrived in Rājagṛha, where he stayed in the Kalandakanivāsa, in Bamboo Grove.

source: དེ་ནས་ཀླུའི་བུ་དེས་ཡང་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: There the young nāga drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and requested the Blessed One,

source: འོད་མའི་ཚལ་འདི་ཉིད་དུ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ན་བཟའ་དང་ཞལ་ཟས་དང་གཟིམས་ཆ་དང་གདན་དང་སྙུན་གསོས་དང་སྨན་ཟོང་རྣམས་སྦྱར་བར་འཚལ་ན
en: “I would like to provide the Blessed One and the rest of the saṅgha of monks for three months with provisions of clothing, food, bedding, seats, and medicines for the sick here in Bamboo Grove.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་བུ་དེ་ལ་ཅང་མི་གསུང་བས་གནང་སྟེ།
en: The Blessed One assented to the young nāga by his silence.

source: ཀླུའི་བུ་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས། འོད་མའི་ཚལ་དེ་ཉིད་དུ་ཟླ་བ་གསུམ་གྱི་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ཏེ།
en: Understanding that by his silence the Blessed One had given his assent, the young nāga then prepared everything they would need for three months there in Bamboo Grove.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས། ཐ་མའི་ཉིན་པར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པས་ཚིམ་པར་བྱས་ཏེ།
en: Once he had provided for all the needs of the Buddha and the rest of the saṅgha of monks for three months, on the last day he contented them with foods of a hundred flavors

source: བཅོམ་ལྡན་འདས་ལ་འབུམ་རི་བའི་ན་བཟའ་ཕུལ་ལོ། །
en: and to the Blessed One he offered a very costly robe.

source: དགེ་སློང་གཞན་རྣམས་ལ་ཡང་སོ་སོར་ཡོ་བྱད་ཐམས་ཅད་ཕུལ་ནས་སེམས་དད་པར་བྱས་ཏེ། གྲལ་དཔོན་གྱི་སྤྱན་སྔར་འདུག་གོ། །
en: To each of the other monks he also offered everything that was needed. Then he took a seat at the head of the row with thoughts of faith,

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཆོས་ཉིད་དེ་དེའི་ཚེ་ཞལ་ནས་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམས་བྱུང་ནསཁ་ཅིག་ནི་འོག་ཏུ་འགྲོའོ། །ཁ་ཅིག་ནི་སྟེང་དུ་འགྲོའོ། །
en: Now it is the nature of the blessed buddhas’ smiles that when they smile, colorful beams of blue, yellow, red, and white light radiate from their mouths, with some traveling up and others traveling down.

source: འོག་ཏུ་འགྲོ་བ་གང་ཡིན་པ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བ་ཡང་སོས་དང་། ཐིག་ནག་དང་། བསྡུས་འཇོམས་དང་། ངུ་འབོད་དང་། ངུ་འབོད་ཆེན་པོ་དང་། ཚ་བ་དང་། རབ་ཏུ་ཚ་བ་དང་མནར་མེད་པ་དང་། ཆུ་བུར་ཅན་དང་། ཆུ་བུར་རྡོལ་དང་། སོ་ཐམས་ཐམས་དང་། ཀྱི་ཧུད་ཟེར་དང་། ཨ་ཆུ་ཟེར་དང་། ཨུད་པལ་ལྟར་གས་པ་དང་། པད་མ་ལྟར་གས་པ་དང་། པད་མ་ལྟར་གས་པ་ཆེན་པོར་སོང་ནསཚ་བའི་སེམས་ཅན་དམྱལ་བ་གང་ཡིན་པ་དེ་དག་ཏུ་ནི་བསིལ་བར་གྱུར་ཏེ་འབབ་བོ། །གྲང་བའི་སེམས་ཅན་དམྱལ་བ་གང་ཡིན་པ་དེ་དག་ཏུ་ནི་དྲོ་བར་གྱུར་ཏེ་འབབ་བོ། །
en: Those that travel down go to the beings in the Reviving Hell, the Black Thread Hell , the Crushing Hell, the Shrieking Hell, the Screaming Hell, the Hot Hell, the Hell of Extreme Heat, the Hell of Ceaseless Agony, the Blistering Hell, the Bursting Blister Hell, the Hell of Chattering Teeth, the Hell of Lamentation, the Cold Whimpering Hell, the Splitting Open Like a Blue Lotus Hell, the Splitting Open Like a Lotus Hell, and the Splitting Open Like a Great Lotus Hell, and as they descend they cool the beings in the hot hells , and warm the beings in the cold hells.

source: དེ་ནས་སེམས་ཅན་དེ་དག་གི་གནོད་པའི་ཁྱད་པར་རྣམས་རྩེ་ཞིལ་བར་གྱུར་ཏོ། །
en: In this way they soothe the particular injuries of those beings,

source: དེ་ནས་དེ་དག་དད་པ་སྐྱེད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་སྤྲུལ་པ་འགྱེད་པར་མཛད་དེ།
en: Then, to engender faith in them, the blessed ones radiate an emanation,

source: དེ་དག་གིས་སྤྲུལ་པ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: and when the beings see it, they think,
